#互联网公司有两种角色，产品经理、程序员。产品经理提开发需求给程序员，然后程序员开发出满足需求功能的程序。
#实操内容：扮演“程序员”接到“产品经理”需求，并完成开发的过程。
'''
产品经理：我这里有个需求比较急，需要开发一个程序。需求文档你先看一下。
产品：工作量计算器
功能简介：
1.已知项目大小、工作人数，计算需要多少工时才能完成
2.或者已知项目大小、总工时，计算要在这样的工时内完成工作，至少需要的工作人数

已知信息：
标准大小的项目，需要一个人用80个工时完成（也就是1个人做10天）

功能演示：
1.5倍标准大小的项目，一共有2个人》》》程序》》》需要60.0个工时
0.8倍标准大小的项目，需要在25个工时内完成》》程序》》需要2.0个人力

磨刀不误砍柴工，梳理需求与功能，分析项目，拆解过程
产品：工作量计算器
已知信息：标准大小的项目，需要一个人用80个工时完成（也就是1个人做10天）
一个人一天是8个工时

计算方式1：工时计算
输入：项目大小（浮点型，代表标准大小的倍数），人数（整数）
输出：工时数量（浮点型）
例子：1.5倍标准大小的项目，一共有2个人》》》程序》》》需要60.0个工时

计算方式2：人力计算
输入：项目大小（浮点型，代表标准大小的倍数），工时数量（浮点型）
输出：人数（整数）
例子：0.8倍标准大小的项目，需要在25个工时内完成》》程序》》需要2.0个人力
0.5倍标准大小的项目，需要在20个工时内完成》》程序》》需要2.0个人力

计算公式：项目大小SIZE*80 /  number人数 = time工时

项目版本设定
版本1.0：能用就好
版本2.0：稍作改良
版本3.0：精细打磨
'''
